labs/student/examples/jaxws/Managers/generated/xml/rpcLiteralManager.xml

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. -->
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://server.jaxws.example.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://server.jaxws.example.com/" name="Managers">
<!-- ... -->
<types>
  <xsd:schema>
    <xsd:import 
	namespace="http://jaxb.dev.java.net/array" 
	schemaLocation="http://localhost:8080/rpcLiteralManager?xsd=1"/>
  </xsd:schema>
</types>
<!-- ... -->
<message name="addAirport">
  <part name="code" type="xsd:string"/>
  <part name="name" type="xsd:string"/>
</message>
<message name="addAirportResponse">
  <part name="return" type="xsd:long"/>
</message>
<message name="findNeighbors">
  <part name="code" type="xsd:string"/>
</message>
<message name="findNeighborsResponse">
  <part xmlns:ns1="http://jaxb.dev.java.net/array" 
	name="return" type="ns1:stringArray"/>
</message>
<!-- ... -->
<portType name="RPCLiteralAirportManager">
  <operation name="addAirport" parameterOrder="code name">
    <input message="tns:addAirport"/>
    <output message="tns:addAirportResponse"/>
  </operation>
  <operation name="findNeighbors">
    <input message="tns:findNeighbors"/>
    <output message="tns:findNeighborsResponse"/>
  </operation>
</portType>
<!-- ... -->
<binding name="AirportMgrBinding" 
	 type="tns:RPCLiteralAirportManager">
  <soap:binding style="rpc"
      transport="http://schemas.xmlsoap.org/soap/http"/>
  <operation name="addAirport">
    <soap:operation soapAction=""></soap:operation>
    <input>
      <soap:body use="literal" 
	namespace="http://server.jaxws.example.com/"/>
    </input>
    <output>
      <soap:body use="literal" 
	namespace="http://server.jaxws.example.com/"/>
    </output>
  </operation>
  <operation name="findNeighbors">
    <soap:operation soapAction=""></soap:operation>
    <input>
      <soap:body use="literal" 
	namespace="http://server.jaxws.example.com/"/>
    </input>
    <output>
      <soap:body use="literal" 
	namespace="http://server.jaxws.example.com/"/>
    </output>
  </operation>
</binding>
<!-- ... -->
<service name="Managers">
  <port name="AirportMgr" binding="tns:AirportMgrBinding">
    <soap:address 
	location="http://localhost:8080/rpcLiteralManager"/>
  </port>
</service>
</definitions>